{
  "dct:title": "Miami-Dade SLOSH Cat 2 Vector",
  "dct:creator": ["NOAA - National Hurricane Center;Organizational;;;https://ror.org/02z5nhe81;ROR;https://ror.org/"],
  "dct:identifier": "http://journals.ametsoc.org/doi/abs/10.1175/WCAS-D-14-00049.1",
  "dct:publisher": ["University of Miami GDSC"],
  "dct:rights": "Public Domain",
  "dct:license": "The data and maps in this tool illustrate the height of possible storm surge flooding under certain scenarios, and do not account for erosion, subsidence, sea-level change or future construction. Water levels are based on storm surge scenarios in the referenced SLOSH MOM tide scenario. The data, maps, and information provided should only be used as a tool for general education/awareness of the storm surge hazard at a city/community level (not for a parcel level/grid cell assessment). The SLOSH MOM storm surge risk data used to create these maps are constrained by the extent of the SLOSH grids and users should be aware that risk due to storm surge flooding could extend beyond the areas depicted in these maps. This map should not be used to replace the maps used for hurricane evacuation zones. Hurricane evacuation zones are drawn at a local and state level and consider additional information and specific criteria for a particular region in addition to the storm surge hazard. Users are urged to consult local officials for flood risk inside the hatched areas marked as leveed areas in the map. The data and maps in this tool are provided \"as is\", without warranty to their performance, merchantable state, or fitness for any particular purpose. The entire risk associated with the results and performance of these data is assumed by the user. This tool should be used strictly as a planning reference and storm surge risk awareness tool and not for navigation, permitting, legal, or regulatory purposes. Any conclusions drawn from the analysis of this information are not the responsibility of the National Weather Service, National Hurricane Center, Office for Coastal Management, or its partners.",
  "dct:coverage": ["Miami-Dade County"],
  "dct:relation": ["sea_2022_noaa_slosh", "fl_2022_tl_cousub"],
  "dct:type": "Vector Dataset",
  "dct:issued": "2014-11-00",
  "dct:description": "A storm surge risk map created by NOAA utilizing the Sea, Lake, and Overland Surges from hurricanes (SLOSH) model. Storm surge composites – Maximum Envelopes of Water (MEOWs) and Maximum of MEOWs (MOMs) – are created to assess and visualize storm surge risk under varying conditions.\n\nMaximum of MEOWs (MOMs) in the attribute table represents the Maximum Envelopes of Water (MEOWs). MEOWs are created by computing the maximum storm surge resulting from up to 100,000 hypothetical storms simulated through each SLOSH grid of varying forward speed, radius of maximum wind, intensity (Categories 1-5), landfall location, tide level, and storm direction. This SLOSH model is based on category 2 storms and has been clipped to Miami-Dade County. This a vector (polygon) version of the original raster model.",
  "dcat:keyword": ["Florida", "Miami-Dade County", "MDC", "Water", "SLOSH", "Cat2", "Vector"],
  "dct:language": "en",
  "adms:representationTechnique": "vector",
  "locn:geometry": "multipolygon",
  "dct:conformsTo": "EPSG:4269",
  "prov:action": "#########\n# GDSC ETL is performed in two steps: shell script to ETL data into postgres\n# and then additional transformations with SQL in postGIS (if needed).\n####\n\n#########\n# Step 1 - bash script (pseudo code)\n####\n\n# create directory structure and move into it\nmkdir -p /data/mdc_2022_slosh_cat2_vector/{download,etl} && cd /data/mdc_2022_slosh_cat2_vector\n\n# set update flag based on last update and update frequency\ndo_update=0 if date() < last_update + update_frequency else do_update = 1\n\n# polygonize raster with:\ngdal_polygonize.py /data/mdc_2022_slosh_cat2/download/mdc_2022_slosh_cat2.tif download/mdc_2022_slosh_cat2_vector.shp Value max_meows \n\n\n#########\n# Step 2 - SQL script (pseudo code):\n####\n\n# load into postGIS with:\n  ogr2ogr -lco GEOMETRY_NAME=geom -f PostgreSQL PG:\"<postgres connection>\" download/mdc_2022_slosh_cat2_vector.shp -nlt multipolygon -nln mdc_2022_slosh_cat2_vector\n# add local geometry column and reproject existing geometries into local EPSG:\nSELECT AddGeometryColumn (\n  'mdc_2022_slosh_cat2_vector',\n  'geom_local',2236,'multipolygon',2\n);\nUPDATE mdc_2022_slosh_cat2_vector\n  SET geom_local=ST_MakeValid(ST_RemoveRepeatedPoints(ST_Transform(ST_Multi(geom),2236)));\nCREATE INDEX mdc_2022_slosh_cat2_vector_geom_local_idx\n  ON mdc_2022_slosh_cat2_vector\n  USING GIST (geom_local);\nNOTIFY pgrst, 'reload schema';\"",
  "prov:wasGeneratedBy": "GDSC automation (see Process Step)",
  "dcat:contactPoint": ["Timothy Norris", "Librarian Associate Professor", "University of Miami Libraries, Frost Institute for Data Science and Computing", "txn60@miami.edu"],
  "gdsc:label": "max_meows",
  "gdsc:attributes": ["max_meows;Maximum Envelopes of Water (MEOWs) based on category 2 storms;maximum storm surge resulting from up to 100,000 hypothetical storms;integer;feet"],
  "gdsc:collections": ["Miami-Dade Climate Resilience", "Little River Climate Resilience"],
  "gdsc:functions": ["gdsc_get_attributes", "gdsc_nearest_neighbor"],
  "gdsc:analyticConformsTo": "EPSG:2236",
  "gdsc:sponsor": ["IDSC;https://idsc.miami.edu", "Library;https://www.library.miami.edu"],
  "dcat:downloadURL": "https://www.nhc.noaa.gov/gis/hazardmaps/US_SLOSH_MOM_Inundation_v3.zip",
  "gdsc:tablename": "mdc_2022_slosh_cat2_vector",
  "dcat:qualifiedRelation": ["mdc_2022_slosh_cat2"],
  "gdsc:up": "true",
  "gdsc:podID": "postgis-qokr49tgr4zp43ll",
  "dct:modified": "2024-10-03 15:47:16",
  "dct:accrualPeriodicity": "As Needed",
  "spdx:checksum": "TBD",
  "dct:extent": ["299154332", "286M"],
  "dcat:bbox": "POLYGON((-80.87347712889816 25.13747326228788,-80.87347712889816 25.975242092415876,-80.11745498925018 25.975242092415876,-80.11745498925018 25.13747326228788,-80.87347712889816 25.13747326228788))"
}
